# Development Tools
cask "docker"
# cask "visual-studio-code"
cask "cursor"
cask "github"
cask "postman"
cask "db-browser-for-sqlite"
cask "araxis-merge"

# Communication Tools
cask "discord"
cask "notion"
# cask "slack"
cask "telegram"
cask "zoom"

# Utility Tools
cask "syncthing"
cask "rustdesk"
cask "windows-app"
cask "anydesk"
cask "x2goclient"
cask "xquartz"

# Entertainment Tools
cask "vlc"
cask "sonos"

# Productivity Tools
cask "rectangle"
cask "raycast"
cask "obsidian"
cask "chatgpt"
cask "claude"
cask "marked"

# Browsers
cask "google-chrome"
cask "arc"
cask "brave-browser"
cask "firefox"

# Microsoft Office Suite
cask "microsoft-excel"
cask "microsoft-word"
cask "microsoft-onenote"
cask "microsoft-teams"
cask "microsoft-powerpoint"
# Required for Microsoft Office apps to receive updates
cask "microsoft-auto-update"

# Cloud Storage & Sync
# cask "google-drive"
cask "onedrive"

# Security & Privacy
cask "1password"
cask "nordvpn"
cask "proton-mail"

# System & Package Management
# Required: Main tap for installing GUI applications via Homebrew
tap "homebrew/cask"

# Mac App Store CLI - Allows installing & managing App Store apps via command line
# Usage examples:
#   mas search Xcode     # Search for apps
#   mas install 497799835  # Install app by ID
#   mas list            # List installed apps
#   mas outdated        # Show apps with updates
#   mas upgrade         # Upgrade all apps
brew "mas"